<?php
//+---------------------------------------------------------------------------------------------------------------------
//| 人生是荒芜的旅行，冷暖自知，苦乐在心
//+---------------------------------------------------------------------------------------------------------------------
//| Author:Janmas <janmas@126.com>
//+---------------------------------------------------------------------------------------------------------------------
//| 
//+---------------------------------------------------------------------------------------------------------------------


namespace Janmas\Message\Model;

use think\Model;

/**
 * 系统消息中心模型
 * @package Janmas\Message\Model
 */
class MessageStation extends Model
{
	protected $name = 'message_station';

	protected $schema = [
		'title' => 'string',
		'id' => 'int',
		'content' => 'string',
		//作用域 1所有用户 2指定用户,
		'scope' => 'int',
		//指定用户集合 longtext其实应该用中间表的但是懒
		'user_ids' => 'string',
		'created_at' => 'string',
		//已发送？0，1已发送
		'is_send' => 'int',
		//发送时间
		'send_time' => 'string',
		//直接发送 0否（只保存不发送） 1是
		'type' => 'int'
	];

}